package com.example.task_15;

import com.example.task_15.models.MainListItem;
import com.example.task_15.models.PriceItem;

public class Masters {
    public static MainListItem[] masters = {
            new MainListItem(
            null, "РБК", null, null, null
                    ),
            new MainListItem(
                    R.drawable.news_1,
                    "Смог ли «коронавирусный» закон защитить арендаторов. Судебные кейсы-2020",
                    "«Коронавирусное» законодательство, принятое в апреле 2020 года, было призвано защитить арендаторов коммерческих помещений, лишившихся дохода из-за локдауна, от произвола арендодателей. Насколько эффективной оказалась эта защита, выяснил РБК Pro",
                    "19.01.2021",
                    "С апреля по декабрь 2020 года арбитражные суды России рассмотрели 183 спора между частными арендаторами и арендодателями коммерческих помещений.\n" +
                            "Арендодателями было подано более сотни исков о взыскании с арендаторов задолженности за период строгого карантина и после него.\n" +
                            "В свою очередь, арендаторы подали свыше 60 исков к арендодателям о признании договора расторгнутым по причине форс-мажора или существенного изменения обстоятельств, о возврате обеспечительного аванса и т.д."),
            new MainListItem(R.drawable.news_2, "Какие подходы помогут компании привлечь временных сотрудников. 5 советов",
                    "Как показал опрос Hays, в 2021-м каждая вторая российская компания планирует нанимать временный персонал, и конкуренция за этих специалистов будет расти с каждым днем. Эксперты рассказали, как эффективно привлекать таких сотрудников и мотивировать их", "18.01.2021",
                    "В 2020 году спрос на временных сотрудников вырос. Таких работников ищут как современные и гибкие компании, так и консервативные организации с долгой историей. А все потому, что наем временного персонала позволяет сократить издержки и упрощает процесс подписания договоров. \n" +
                            "По данным исследования Hays, в котором приняли участие 4930 респондентов, в 2021 году каждая вторая организация планирует нанять временных или контрактных работников. Треть опрошенных (28%) собираются привлечь такой персонал к проектной и сезонной деятельности, 12% — заменить им постоянных сотрудников, которые ушли в долгосрочный отпуск. Еще 7% респондентов рассказали, что им сложно найти подходящих кандидатов в штат, поэтому они сотрудничают с подрядчиками. В 15% компаний уверены, что сделают расходы на персонал более гибкими, нанимая временных работников. 4% опрошенных утверждают, что сотрудничество с такими профессионалами позволяет им получить доступ к узкой экспертизе."
                    ),
            new MainListItem(R.drawable.news_3, "«Мы убьем российский футбол». Реакция на идею сокращения РПЛ",
                    "РФС всерьез рассматривает вопрос сокращения числа команд РПЛ. Какую цель преследуют сторонники идеи и как отреагировали клубы — об этом в материале РБК",
                    "18.01.2021",
                    "Сокращение числа команд приведет к заметному изменению формата Тинькофф — Российской премьер-лиги (РПЛ). Как сообщает «РБ-Спорт», существуют два варианта изменения формата. Первый предусматривает проведение двух кругов с участием 12 команд в течение 22 игровых дней. После этого все клубы — в соответствии с результатами первого этапа — делят на две группы по шесть команд. Команды первой корзины в ходе десяти игровых дней будут выявлять будущих участников еврокубков от России. Клубы из второй группы будут бороться за сохранение мест в РПЛ."
                    ),
            new MainListItem(R.drawable.news_4, "Возможные санкции Запада после ареста Навального. Что важно знать",
                    "ЕС и советники Джо Байдена заявили о возможных новых санкциях, если Алексей Навальный не будет освобожден. Какие механизмы может задействовать Запад и почему санкции останутся на уровне персональных — разбирался РБК", "18.01.2021",
                    "После задержания и ареста Алексея Навального по прилете в Москву из Берлина представители Евросоюза и будущей администрации избранного президента США Джо Байдена дали понять, что против России могут последовать новые санкции, если Навальный не будет освобожден"
                    ),
            new MainListItem(
                    null, "Лента.ру", null, null, null
            ),
            new MainListItem(
                    R.drawable.news_5,
                    "Осколки Союза",
                    "Распад Советского Союза оставил множество архитектурных отголосков сверхдержавы в Восточной Европе и Азии. После смерти Сталина господствующим стилем в зодчестве был модернизм, пришедший с Запада и «осовеченный». Благодаря узнаваемым чертам такие здания превратились в целую россыпь подчас инопланетных артефактов на территории бывшего СССР. Памятники эпохи взяла под крыло румынская организация BACU (Бюро художественных и городских исследований). Она создала проект Socialist modernism, посвященный охране и изучению архитектуры советского модернизма. Забетонированное прошлое — в подборке «Ленты.ру».",
                    "19.01.2021",
                    "Здания совмода строили в период с 1955 по 1991 год в странах Восточного блока. Рождение стиля связывают с хрущевской оттепелью — тогда отечественные архитекторы начали читать профильные журналы и обмениваться опытом с западными коллегами. Социалистический реализм схож с брутализмом: массивные формы, функциональность, монолитность, преимущественно светло-серый цвет, поскольку главным материалом был железобетон. Ничего лишнего — только представительность и надежность."),
            new MainListItem(R.drawable.news_6, "Белоруссию лишили чемпионата мира по хоккею 2021 года",
                    "Решение о лишении Белоруссии права принимать турнир было принято в понедельник, 18 января, на заседании совета IIHF. В организации отметили, что не могут гарантировать безопасность игрокам, болельщикам и официальным лицам. «Мы хотели использовать проведение турнира для примирения сторон и решения социально-политических проблем в Белоруссии. И хотя совет считает, что чемпионат мира не должен использоваться для политической пропаганды, нельзя не признать, что проведение турнира в Минске было бы неуместным», — заявил президент IIHF Рене Фазель.", "18.01.2021",
                    "Фазель до последнего не хотел менять место проведения чемпионата мира и говорил, что спорт должен находиться вне политики. За несколько дней до решения глава IIHF посетил Белоруссию, где Лукашенко старался убедить его в безопасности проведения турнира в Минске. Не обошлось и без разговора о политике. «Упомянул ли я ситуацию с политическими заключенными? По словам Лукашенко, политических заключенных в Белоруссии нет, а после демонстраций людей сажают в тюрьму за уголовные преступления, а не политические. Согласен ли я с этим? Не знаю», — рассказывал Фазель. Визит главы IIHF в Белоруссию на Западе был воспринят критически. Многие восприняли его действия как знак поддержки Лукашенко, с которым функционер знаком не один десяток лет."
            ),

    };
}
